In [1]:
import pandas as pd
import numpy as np

In [2]:
array=[7,9,76,32,5]
series = pd.Series(array)
print(series)

0     7
1     9
2    76
3    32
4     5
dtype: int64

In [1]:
import pandas as pd
import numpy as np
for i in range(1,11):
    if i %3==0 and i%5==0:
        print("fizzbuzz")
    elif i%3==0:
        print("fizz ")
    elif  i %5==0:
        print("buzz") 
    else:   
        print(i)
print(i)         
series=pd.Series(i)

1
2
fizz
4
buzz
fizz
7
8
fizz
buzz
10

In [4]:
data = {"name": ["riya","priya", "john", "dev","raj"],
       "age":[23,43,26,55,34],
       "dept": ["Testing","Engineering","Design","manager","developer"],
       "salary":[40000,50000,52000,70000,56000],
       "city": ["mumbai","dehradun","nashik","solapur","delhi",]}
df=pd.DataFrame(data)
print(df)

    name  age         dept  salary      city
0   riya   23      Testing   40000    mumbai
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik
3    dev   55      manager   70000   solapur
4    raj   34    developer   56000     delhi

In [5]:
age_30=df[df["age"]>30]
print(age_30)

    name  age         dept  salary      city
1  priya   43  Engineering   50000  dehradun
3    dev   55      manager   70000   solapur
4    raj   34    developer   56000     delhi

In [6]:
salary_above=df[df["salary"]>60000]
print(salary_above)

  name  age     dept  salary     city
3  dev   55  manager   70000  solapur

In [7]:
enggordesign=df[df["dept"].isin(["Engineering" ,"Design"])]
print(enggordesign)

    name  age         dept  salary      city
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik

In [8]:
citywithmd=df[df["city"].isin(["solapur","mumbai"])]
print(citywithmd)

   name  age     dept  salary     city
0  riya   23  Testing   40000   mumbai
3   dev   55  manager   70000  solapur

In [9]:
print(df.iloc[[0,1,2]])

    name  age         dept  salary      city
0   riya   23      Testing   40000    mumbai
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik

In [10]:
print(df.dtypes)

name      object
age        int64
dept      object
salary     int64
city      object
dtype: object

In [11]:
print(df.describe())

             age        salary
count   5.000000      5.000000
mean   36.200000  53600.000000
std    13.065221  10899.541275
min    23.000000  40000.000000
25%    26.000000  50000.000000
50%    34.000000  52000.000000
75%    43.000000  56000.000000
max    55.000000  70000.000000

In [12]:
print(df)

    name  age         dept  salary      city
0   riya   23      Testing   40000    mumbai
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik
3    dev   55      manager   70000   solapur
4    raj   34    developer   56000     delhi

In [13]:
print(df.iloc[[0,1,2]])

    name  age         dept  salary      city
0   riya   23      Testing   40000    mumbai
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik

In [14]:
rim=0
while rim<3:
    print(df.loc[rim])
    print("--")
    rim+=1

name         riya
age            23
dept      Testing
salary      40000
city       mumbai
Name: 0, dtype: object
--
name            priya
age                43
dept      Engineering
salary          50000
city         dehradun
Name: 1, dtype: object
--
name        john
age           26
dept      Design
salary     52000
city      nashik
Name: 2, dtype: object
--

In [15]:
print(df)

    name  age         dept  salary      city
0   riya   23      Testing   40000    mumbai
1  priya   43  Engineering   50000  dehradun
2   john   26       Design   52000    nashik
3    dev   55      manager   70000   solapur
4    raj   34    developer   56000     delhi

In [16]:
avg_marks=df.groupby("dept")["salary"].mean()
print(avg_marks)

dept
Design         52000.0
Engineering    50000.0
Testing        40000.0
developer      56000.0
manager        70000.0
Name: salary, dtype: float64

In [17]:
df.to_csv("students_details.csv",index=False)

In [18]:
df.to_html("students_details.html")

In [19]:
df.to_csv("laptop_data_100.csv")

In [20]:
loaded_df=pd.read_csv("laptop_data_100.csv")

In [21]:
print(loaded_df)

   Unnamed: 0   name  age         dept  salary      city
0           0   riya   23      Testing   40000    mumbai
1           1  priya   43  Engineering   50000  dehradun
2           2   john   26       Design   52000    nashik
3           3    dev   55      manager   70000   solapur
4           4    raj   34    developer   56000     delhi

In [22]:
loaded_df.head()

   Unnamed: 0   name  age         dept  salary      city
0           0   riya   23      Testing   40000    mumbai
1           1  priya   43  Engineering   50000  dehradun
2           2   john   26       Design   52000    nashik
3           3    dev   55      manager   70000   solapur
4           4    raj   34    developer   56000     delhi

### Print samsung laptops priced between 50000 to 70000

In [23]:
samsung_val=loaded_df[(loaded_df['Brand']=='Samsung') &
                      (loaded_df['Price (INR)'] >= 50000)&
                      (loaded_df['Price (INR)'] <= 70000)]
print(samsung_val)

KeyError: 'Brand'

### Total lenova comapny laptops whose price between 50k to 1l

In [ ]:
lenovo_val=loaded_df[
       (loaded_df['Brand'] == 'Lenovo') &
        (loaded_df['Price (INR)'] >= 50000) &
        (loaded_df['Price (INR)'] <= 100000) 
]['Price (INR)'].sum()
print("total lenovo company laptops between 50000 to 100000:",lenovo_val)